In [4]:
# Loading data 
# From 4 csv file sources 

import pandas as pd
import numpy as np
import os



# Loading customers.csv
customers_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/customers.csv")

#Loading orders.csv
orders_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/orders.csv")

# Loading products.csv
products_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/products.csv")

# Loading order_details.csv
order_details_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/order_details.csv")

In [5]:
customers_df.sample(3)

      customer_id             name         city      state signup_date
564           565  Jeffrey Russell  Farleyhaven   Arkansas  2024-07-31
1880         1881  Ashley Martinez  New Whitney    Arizona  2024-10-02
340           341     Brian Taylor   Port Jacob  Minnesota  2022-02-03

In [6]:
# Missing values problems / nulls
print("____________ customers_df _________________")

customers_df.isnull().sum()

____________ customers_df _________________

customer_id    0
name           0
city           0
state          0
signup_date    0
dtype: int64

In [7]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  2000 non-null   int64
 1   name         2000 non-null   object
 2   city         2000 non-null   object
 3   state        2000 non-null   object
 4   signup_date  2000 non-null   object
dtypes: int64(1), object(4)
memory usage: 78.3+ KB

signup_date = object which is string that is wrong

In [8]:
customers_df.duplicated().sum()

np.int64(0)

In [9]:
customers_df["customer_id"].is_unique

True

In [10]:
customers_df["name"].unique()

array(['Kristen Oconnell', 'Andrea Jenkins', 'Maureen Hale', ...,
       'Jennifer Walker', 'Brett Gibson', 'Thomas Jones'],
      shape=(1967,), dtype=object)

In [11]:
customers_df["city"].unique()

array(['Mckinneyshire', 'East Lindsay', 'Lisamouth', ..., 'Port Larry',
       'Millerport', 'Michaelstad'], shape=(1858,), dtype=object)

In [12]:
customers_df["state"].unique()

array(['South Carolina', 'Mississippi', 'Delaware', 'Montana', 'Arizona',
       'Hawaii', 'Maryland', 'North Carolina', 'Nevada', 'Massachusetts',
       'Louisiana', 'Kansas', 'Oregon', 'Nebraska', 'Washington', 'Idaho',
       'North Dakota', 'Wyoming', 'Illinois', 'Arkansas', 'New Hampshire',
       'Alaska', 'New Mexico', 'Utah', 'Oklahoma', 'Minnesota',
       'South Dakota', 'Wisconsin', 'Alabama', 'Indiana', 'Florida',
       'Iowa', 'Pennsylvania', 'Missouri', 'Georgia', 'Ohio', 'Colorado',
       'California', 'Virginia', 'New Jersey', 'Connecticut', 'Kentucky',
       'Rhode Island', 'New York', 'West Virginia', 'Tennessee',
       'Michigan', 'Vermont', 'Maine', 'Texas'], dtype=object)

In [13]:
customers_df.describe()

       customer_id
count  2000.000000
mean   1000.500000
std     577.494589
min       1.000000
25%     500.750000
50%    1000.500000
75%    1500.250000
max    2000.000000

In [14]:
customers_df['signup_date'].min()

'2020-11-16'

In [15]:
customers_df['signup_date'].max()

'2025-11-15'

In [16]:
# checking for duplicated rows 
customers_df.duplicated().sum()

np.int64(0)

In [17]:
products_df.duplicated().sum()

np.int64(0)

In [18]:
orders_df.duplicated().sum()

np.int64(0)

In [19]:
order_details_df.duplicated().sum()

np.int64(0)

In [20]:
customers_df.sample()

     customer_id         name             city    state signup_date
574          575  Warren Hall  West Joshualand  Florida  2022-09-05

In [21]:
# Checking if the id are unique and not null
print("Checking if the id column is unique or not")
customers_df["customer_id"].is_unique

Checking if the id column is unique or not

True

In [22]:
products_df.sample()

    product_id product_name  category  unit_price  cost_price
13          14        Focus  Clothing      139.17      171.99

In [23]:
products_df["product_id"].is_unique

True

In [24]:
orders_df["order_id"].is_unique

True

In [25]:
# checking text inconsitency like spaces, some upper case some lower case and so on 
print("checking text inconsistency")

checking text inconsistency

In [26]:
print("For table customers")
customers_df.sample(3)

For table customers

      customer_id             name            city     state signup_date
771           772        Gary Lane  Santanaborough  Delaware  2021-04-09
741           742     Travis Ortiz    Williamhaven   Wyoming  2022-04-08
1114         1115  Megan Henderson    North Jeremy  Michigan  2022-11-13

In [27]:
customers_df["name"].unique()

array(['Kristen Oconnell', 'Andrea Jenkins', 'Maureen Hale', ...,
       'Jennifer Walker', 'Brett Gibson', 'Thomas Jones'],
      shape=(1967,), dtype=object)

In [28]:
customers_df["city"].unique()

array(['Mckinneyshire', 'East Lindsay', 'Lisamouth', ..., 'Port Larry',
       'Millerport', 'Michaelstad'], shape=(1858,), dtype=object)

In [29]:
customers_df["state"].unique()

array(['South Carolina', 'Mississippi', 'Delaware', 'Montana', 'Arizona',
       'Hawaii', 'Maryland', 'North Carolina', 'Nevada', 'Massachusetts',
       'Louisiana', 'Kansas', 'Oregon', 'Nebraska', 'Washington', 'Idaho',
       'North Dakota', 'Wyoming', 'Illinois', 'Arkansas', 'New Hampshire',
       'Alaska', 'New Mexico', 'Utah', 'Oklahoma', 'Minnesota',
       'South Dakota', 'Wisconsin', 'Alabama', 'Indiana', 'Florida',
       'Iowa', 'Pennsylvania', 'Missouri', 'Georgia', 'Ohio', 'Colorado',
       'California', 'Virginia', 'New Jersey', 'Connecticut', 'Kentucky',
       'Rhode Island', 'New York', 'West Virginia', 'Tennessee',
       'Michigan', 'Vermont', 'Maine', 'Texas'], dtype=object)

In [30]:
print("checking text inconsistency for product df/table")
print("prodcut_df DataFrame")
products_df.sample(3)

checking text inconsistency for product df/table
prodcut_df DataFrame

     product_id product_name category  unit_price  cost_price
103         104        Spend   Sports       12.59       53.92
100         101         Send     Food      330.99        3.18
181         182        Ready     Food      104.66      250.90

In [31]:
products_df["product_name"].is_unique

False

In [32]:

products_df["product_name"].unique()

array(['Fear', 'Reflect', 'Pay', 'Certain', 'Message', 'Country', 'Cold',
       'Very', 'Decide', 'Son', 'Seven', 'Born', 'Have', 'Focus', 'They',
       'Down', 'Health', 'Energy', 'World', 'Argue', 'Road', 'Report',
       'Already', 'Such', 'Specific', 'Hospital', 'Never', 'Change',
       'Debate', 'Entire', 'Their', 'Operation', 'According', 'Political',
       'Smile', 'Position', 'Simply', 'Happen', 'Black', 'Until', 'Deep',
       'Yourself', 'Hand', 'Culture', 'Citizen', 'National', 'Prepare',
       'How', 'Seat', 'Doctor', 'Leg', 'Example', 'Admit', 'Case', 'Race',
       'Daughter', 'Marriage', 'Particular', 'Official', 'Establish',
       'Far', 'Service', 'Our', 'Catch', 'Do', 'Away', 'At', 'After',
       'Child', 'Sport', 'International', 'Later', 'Effect', 'Put',
       'Process', 'Mission', 'Performance', 'Trip', 'Will', 'Fall',
       'There', 'Husband', 'Nation', 'Plant', 'History', 'Success',
       'Drop', 'Manager', 'Weight', 'Table', 'Church', 'Ago',
       'Professional', 'Scene', 'Wife', 'Send', 'Professor', 'Treatment',
       'Spend', 'Understand', 'Language', 'Listen', 'Thing', 'Push',
       'Affect', 'Against', 'Everybody', 'Mention', 'Stand', 'Offer',
       'Another', 'Prove', 'Read', 'Lawyer', 'Support', 'Possible',
       'View', 'Without', 'Lay', 'Financial', 'Drive', 'Much', 'Figure',
       'Pick', 'Yeah', 'Phone', 'Trade', 'Public', 'Wind', 'Three',
       'Shake', 'Off', 'Only', 'Product', 'Indicate', 'Computer', 'Least',
       'Simple', 'Point', 'Difficult', 'Though', 'Carry', 'Lot', 'Issue',
       'Clear', 'Sister', 'Nature', 'Full', 'Different', 'Grow',
       'Purpose', 'Physical', 'Usually', 'Join', 'Important', 'Number',
       'Save', 'Memory', 'Great', 'Small', 'Recently', 'Ability', 'Teach',
       'Increase', 'Ready', 'Development', 'Free', 'Partner',
       'Participant', 'Among', 'Star', 'Box', 'Source', 'Short',
       'Through', 'Large'], dtype=object)

In [33]:
print("product_name has weird entries which does not seems real products")

product_name has weird entries which does not seems real products

In [34]:
products_df["category"].unique()

array(['Sports', 'Food', 'Electronics', 'Home', 'Clothing'], dtype=object)

In [35]:
print("checking text inconsistency for orders df/table")
orders_df.sample(3)

checking text inconsistency for orders df/table

      order_id  customer_id  order_date order_status
410        411          368  2025-09-05    Cancelled
7353      7354          547  2024-05-21    Completed
2435      2436         1313  2024-01-22      Shipped

In [36]:
orders_df["order_status"].unique()

array(['Cancelled', 'Completed', 'Shipped'], dtype=object)

In [37]:
order_details_df.sample(3)

      order_id  product_id  quantity  discount
4102      3135         132         5      0.30
6641      4810         147         7      0.11
5643      7507         171         9      0.09

In [38]:
# Checking numeric validiy if numbers given make sense
order_details_df[order_details_df["quantity"] <= 0]

Empty DataFrame
Columns: [order_id, product_id, quantity, discount]
Index: []

In [39]:
# Checking discount validity
order_details_df[order_details_df["discount"] > 1]

Empty DataFrame
Columns: [order_id, product_id, quantity, discount]
Index: []

In [40]:
order_details_df[order_details_df["discount"] < 0]

Empty DataFrame
Columns: [order_id, product_id, quantity, discount]
Index: []

In [41]:
products_df.sample()

     product_id product_name category  unit_price  cost_price
128         129      History     Food      137.49      206.48

In [42]:
print("checking unit_price and cost_price are positive values")
products_df[products_df["unit_price"] <= 0] # unit_price : The price amount we sell product on

checking unit_price and cost_price are positive values

Empty DataFrame
Columns: [product_id, product_name, category, unit_price, cost_price]
Index: []

In [43]:
products_df[products_df["cost_price"] <= 0]

Empty DataFrame
Columns: [product_id, product_name, category, unit_price, cost_price]
Index: []

In [44]:
products_df[products_df['cost_price'] > products_df['unit_price']].sample(5)

     product_id product_name     category  unit_price  cost_price
112         113      Mention     Clothing       70.99      187.07
181         182        Ready         Food      104.66      250.90
36           37     Position  Electronics       54.12      253.62
75           76      Process         Food       34.14      168.92
5             6      Country       Sports       57.04      199.12

In [45]:
products_df[products_df['cost_price'] > products_df['unit_price']].count().sum()

np.int64(255)

In [46]:
print("There are a lot of product which cost price is greater to unit price")

There are a lot of product which cost price is greater to unit price

In [47]:
orders_df.merge(customers_df, on='customer_id') \
      .query('order_date < signup_date').sample(5)

,order_id,customer_id,order_date,order_status,name,city,state,signup_date
5279,5280,1081,2022-12-04,Completed,Kelly Wright,Nunezhaven,Kentucky,2024-03-22
4220,4221,679,2023-07-30,Completed,Scott Mullins,East Michaelland,Wisconsin,2025-02-08
1354,1355,295,2022-12-13,Completed,Ashley Turner,East Paulburgh,California,2025-07-25
3939,3940,1994,2024-05-03,Completed,Margaret Wilson,Jonathanton,Kentucky,2024-05-14
3600,3601,1149,2025-06-08,Completed,Scott Jacobs,Wellsfort,Alabama,2025-06-18

In [48]:
print("lots of inconsistance order and signup_date")

lots of inconsistance order and signup_date

In [49]:
print("----------------- ORDERS -------------------")
orders_df.sample(5)

----------------- ORDERS -------------------

      order_id  customer_id  order_date order_status
7361      7362         1552  2024-11-16      Shipped
2203      2204          370  2024-07-05    Completed
6005      6006           53  2025-10-24      Shipped
1422      1423         1764  2024-01-18    Completed
2205      2206         1308  2024-04-17      Shipped

In [50]:
print("------------------ ORDER DETAILS -----------------")
order_details_df.sample(5)

------------------ ORDER DETAILS -----------------

      order_id  product_id  quantity  discount
4265      6650          21         4      0.26
5016      7511          39         1      0.30
3245      7862         184         1      0.13
9359      7713         140         1      0.05
4339      2905          59         6      0.21

In [51]:
order_details_df[~order_details_df["product_id"].isin(products_df["product_id"])]

Empty DataFrame
Columns: [order_id, product_id, quantity, discount]
Index: []

In [52]:
orders_df[~orders_df["customer_id"].isin(customers_df["customer_id"])]

Empty DataFrame
Columns: [order_id, customer_id, order_date, order_status]
Index: []

In [53]:
order_details_df[~order_details_df["order_id"].isin(orders_df["order_id"])]

Empty DataFrame
Columns: [order_id, product_id, quantity, discount]
Index: []

In [54]:
print("There seems to not be any intregrity problems")

There seems to not be any intregrity problems

In [55]:
products_df['product_name'].str.strip()

0         Fear
1      Reflect
2          Pay
3      Certain
4      Message
        ...
195    Product
196      Short
197    Through
198      Large
199    Example
Name: product_name, Length: 200, dtype: object

In [56]:
products_df['product_name'].duplicated().sum()

np.int64(24)

In [58]:
orders_df.sample()

      order_id  customer_id  order_date order_status
1238      1239         1743  2023-12-16    Completed

In [60]:
orders_df.info()

<bound method DataFrame.info of       order_id  customer_id  order_date order_status
0            1         1575  2023-06-24    Cancelled
1            2         1494  2024-03-24    Completed
2            3         1317  2024-06-19    Completed
3            4          587  2025-05-26      Shipped
4            5         1035  2025-09-21    Completed
...        ...          ...         ...          ...
7995      7996         1856  2025-07-30    Completed
7996      7997           59  2024-09-05    Completed
7997      7998         1257  2023-12-27    Completed
7998      7999          871  2024-05-14    Completed
7999      8000         1875  2025-04-15    Completed

[8000 rows x 4 columns]>